- R과 Pnadas 특징
    - R보다 Pandas가 학습이 쉬움
    - R보다 Pandas가 성능이 좋음
    - R보다 Python은 활용 가능 분야가 많음
- 크게 두 가지 데이터 타입을 사용
    - Series
        - index 와 value로 우어진 데이터 타입
    - Dataframe
        - index, column, value,로 이러어진 데이터 타입

### 1. Series
- 동일한 데이터 타입의 값을 갖습니다.

In [5]:
data = pd.Series(np.random.randint(10, size=5))
data

0    5
1    2
2    3
3    1
4    3
dtype: int32

In [8]:
# index 설정
data = pd.Series(np.random.randint(10, size=5), index=list("ABCDE"))
data

A    7
B    4
C    8
D    1
E    5
dtype: int32

In [11]:
data.index,data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([7, 4, 8, 1, 5]))

In [12]:
data2 = pd.Series({"D":3, "E":5, "F":7})

In [13]:
data2

D    3
E    5
F    7
dtype: int64

In [16]:
res = data + data2 # NaN = Not a Number
res

A     NaN
B     NaN
C     NaN
D     4.0
E    10.0
F     NaN
dtype: float64

In [17]:
res.isnull()

A     True
B     True
C     True
D    False
E    False
F     True
dtype: bool

### 2. Dataframe
- 데이터 프레임은 여러개의 Series 로 구성
- 같은 컬럼에 있는 value 값은 데이터 타입을 갑습니다.

In [23]:
# 데이터 프레임 생성 : 딕셔너리의 리스트
datas = {
    "name" : ["dss", "fcamp"],
    "email": ["dss@gmail.com", "fcamp@naver.com"]
}

In [24]:
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@gmail.com', 'fcamp@naver.com']}

In [25]:
df = pd.DataFrame(datas)

In [26]:
df

    name            email
0    dss    dss@gmail.com
1  fcamp  fcamp@naver.com

In [27]:
datas2 = [
    {"a":1, "b":2},
    {"a":3, "b":4},
    {"a":7, "b":6},
]

In [28]:
datas2

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}, {'a': 7, 'b': 6}]

In [47]:
df2 = pd.DataFrame(datas2)
df2

   a  b
0  1  2
1  3  4
2  7  6

In [48]:
# 인덱스를 설정하는 방법
df2 = pd.DataFrame(datas2, index=["one", "two", "three"])
df2

       a  b
one    1  2
two    3  4
three  7  6

In [49]:
df2.index

Index(['one', 'two', 'three'], dtype='object')

In [50]:
df2.values

array([[1, 2],
       [3, 4],
       [7, 6]], dtype=int64)

In [51]:
df2.columns

Index(['a', 'b'], dtype='object')

In [58]:
# 데이터 프레임 생성 : 딕셔너리의 리스트
datas = {
    "name" : ["dss", "fcamp"],
    "email": ["dss@gmail.com", "fcamp@naver.com"]
}
df = pd.DataFrame(datas)

In [60]:
df

    name            email
0    dss    dss@gmail.com
1  fcamp  fcamp@naver.com

In [69]:
df.loc[1] = {"name":"test", "email":"namver"}

In [70]:
df

   name          email
0   dss  dss@gmail.com
1  test         namver
2  test         namver

In [71]:
df.dtypes

name     object
email    object
dtype: object

In [74]:
df.loc[df["name"] == 'dss']

  name          email
0  dss  dss@gmail.com

In [77]:
df.head(n=1)

  name          email
0  dss  dss@gmail.com

In [78]:
df.tail(n=1)

   name   email
2  test  namver

In [82]:
# 데이터 프레임 생성 : 딕셔너리의 리스트
datas = {
    "name" : ["dss", "fcam", 'test'],
    "email": ["dss@gmail.com", "fcamp@naver.com", "test@naver.com"],
}
df = pd.DataFrame(datas)
df

   name            email
0   dss    dss@gmail.com
1  fcam  fcamp@naver.com
2  test   test@naver.com

In [84]:
def domain(email):
    return email.split("@")[1].split(".")[0]

In [87]:
df["domain"] = df["email"].apply(domain)

In [90]:
df["domain2"] = df["email"].apply(lambda email:email.split("@")[1].split(".")[0])

In [91]:
df

   name            email domain domain2
0   dss    dss@gmail.com  gmail   gmail
1  fcam  fcamp@naver.com  naver   naver
2  test   test@naver.com  naver   naver

In [92]:
# 사람의 이름과 나이가 들어간 데이터를 만듭니다.
import random
import numpy as np

# 랜덤한 이름 출력하는 함수
def get_name():
    names = ["Adam", "Alan", "Alex", "Alvin", "Andrew",
             "Anthony", "Arnold", "Jin", "Billy", "Anchal"]
    return random.choice(names)

# 랜덤한 나이 출력
def get_age(start=20, end=40):
    return np.random.randint(start, end + 1)

# 랜덤하게 나이와 이름을 출력
def make_data(rows=10):
    datas = []
    for _ in range(rows):
        data = {"Age": get_age(), "Name": get_name()}
        datas.append(data)
    return datas

In [104]:
data = make_data(rows=5)
data

[{'Age': 36, 'Name': 'Alvin'},
 {'Age': 33, 'Name': 'Andrew'},
 {'Age': 37, 'Name': 'Billy'},
 {'Age': 23, 'Name': 'Alex'},
 {'Age': 31, 'Name': 'Anchal'}]

In [105]:
df1 = pd.DataFrame(data)
df2 = pd.DataFrame(data)

In [115]:
df3 = df1.append(df2).reset_index(drop=True)
df3

   Age    Name
0   36   Alvin
1   33  Andrew
2   37   Billy
3   23    Alex
4   31  Anchal
5   36   Alvin
6   33  Andrew
7   37   Billy
8   23    Alex
9   31  Anchal